## Series

In [1]:
import pandas as pd  
import numpy as np

In [2]:
heros = pd.Series([100, 200, 300], index=["Такеда", "Хонда", "Ода"])
heros # Позволяет из списка сделать таблицу состоящую из 1 столбца.

Такеда    100
Хонда     200
Ода       300
dtype: int64

## DataFrame

In [3]:
information = {"Имя": ["Алиса", "Боб", "Катя"],
           "Возраст": [25, 30, 22],
             "Город": ["Киото", "Эдо", "Осака"]
}
df = pd.DataFrame(information, index=[i for i in range(1, 4)]) 
index=[i for i in range(1, 4)] # задает индексы строк с 1 по 3. 
# Позволяет из словаря сделать таблицу состоящую из нескольких столбцов.
df

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [4]:
df.head(10) # Показывает первые 10 строк таблицы.

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [5]:
df.tail(3) # Показывает последние 3 строки таблицы.

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [6]:
df.shape # Показывает размер таблицы (строки, столбцы).

(3, 3)

In [7]:
df.info() 
# Показывает информацию о таблице: количество строк, столбцов, типы данных.

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Имя      3 non-null      object
 1   Возраст  3 non-null      int64
 2   Город    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [8]:
df.describe() # Показывает статистические данные по числовым столбцам таблицы.

         Возраст
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

In [9]:
info = {'Имя' : ['Александр', 'Василий'],   
    'Возраст' : [22, 19],
    'Город' : ['Киото', 'Эдо'], 
    'Способность' : ['Сила', 'Ум']
     }
df = pd.DataFrame(info, index =[i for i in range(1, 3)])
df

         Имя  Возраст  Город Способность
1  Александр       22  Киото        Сила
2    Василий       19    Эдо          Ум

In [10]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels) 
df
# Создает таблицу из словаря с заданными индексами строк.

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [11]:
data['age']

[2.5, 3, 0.5, nan, 5, 2, 4.5, nan, 7, 3]

In [12]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)

print(f"Размерность таблицы: {df.shape[0]} строк, {df.shape[1]} столбцов")
# Выводит размер таблицы в формате: количество строк, количество столбцов
# по оси 0 - строки, по оси 1 - столбцы

Размерность таблицы: 10 строк, 4 столбцов

In [13]:
info = {'Имя' : ['Александр', 'Василий'],   
    'Возраст' : [22, 19],
    'Город' : ['Киото', 'Эдо'], 
    'Способность' : ['Сила', 'Ум']
     }
df = pd.DataFrame(info, index =[i for i in range(1, 3)])
df

         Имя  Возраст  Город Способность
1  Александр       22  Киото        Сила
2    Василий       19    Эдо          Ум

In [14]:
df.iloc[0] # Выводит первую строку таблицы по её позиции (индексу).

Имя            Александр
Возраст               22
Город              Киото
Способность         Сила
Name: 1, dtype: object

In [15]:
df['Возраст'] # Выводит столбец 'Возраст' таблицы.

1    22
2    19
Name: Возраст, dtype: int64

In [16]:
# df.loc # Используется для доступа к данным по меткам (индексам) строк и столбцов.
# df.iloc # Используется для доступа к данным по позициям 
# (целочисленным индексам) строк и столбцов.

In [17]:
df.iloc[1,3] # Выводит значение из второй строки и четвертого столбца таблицы.

'Ум'

In [18]:
df.iloc[1, 2:4] 
# Выводит значения из второй строки и 
# столбцов с третьего по четвертый (не включая пятый).

Город          Эдо
Способность     Ум
Name: 2, dtype: object

In [19]:
df.loc[1] # Выводит строку таблицы с индексом 1.

Имя            Александр
Возраст               22
Город              Киото
Способность         Сила
Name: 1, dtype: object

In [20]:
df.loc[2, 'Город'] # Выводит значение из строки с индексом 2 и столбца 'Город'.

'Эдо'

In [21]:
df = pd.DataFrame({
    'animal': ['cat', 'dog', 'cat', 'dog'],
    'age': [2, 7, 1, 5]
})
df

  animal  age
0    cat    2
1    dog    7
2    cat    1
3    dog    5

In [22]:
mask = df['animal'] == 'cat'  
# Создает булеву маску для строк, где значение в столбце 'animal' равно 'cat'.
df[mask] # Применяет маску к DataFrame, возвращая 
# только строки, где условие маски истинно.

  animal  age
0    cat    2
2    cat    1

In [23]:
df[df['animal'] == 'cat']
# То же самое, что и выше, но без создания отдельной переменной mask.

  animal  age
0    cat    2
2    cat    1

In [24]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]
# Фильтрует строки, где 'animal' равно 'cat' и 'age' меньше 3.

  animal  age
0    cat    2
2    cat    1

In [25]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
filter_names = ["animal", "age"] # Названия столбцов для фильтрации.
filter_values = ["cat", 3] # Значения для фильтрации по столбцам.
df

  animal  age     name  visits priority
a    cat  2.5   Murzik       1      yes
b    cat  3.0   Pushok       3      yes
c  snake  0.5      Kaa       2       no
d    dog  NaN    Bobik       3      yes
e    dog  5.0  Strelka       2       no
f    cat  2.0    Vaska       3       no
g  snake  4.5     Kaa2       1       no
h    cat  NaN    Murka       1      yes
i    dog  7.0     Graf       2       no
j    dog  3.0   Muhtar       1       no

In [26]:
df[(df[filter_names[0]] == filter_values[0]) & (df[filter_names[1]] < filter_values[1])]
# Фильтрует строки таблицы df, где значение в столбце, 
# название которого хранится в filter_names[0], равно filter_values[0], 
# и значение в столбце, название которого хранится в filter_names[1],
# меньше filter_values[1].

  animal  age    name  visits priority
a    cat  2.5  Murzik       1      yes
f    cat  2.0   Vaska       3       no

In [27]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
age_between = [2, 4] # Возрастной диапазон для фильтрации.
df[(df['age'] >= age_between[0]) & (df['age'] <= age_between[1])]
# Фильтрует строки таблицы df, где значение в столбце 'age

  animal  age    name  visits priority
a    cat  2.5  Murzik       1      yes
b    cat  3.0  Pushok       3      yes
f    cat  2.0   Vaska       3       no
j    dog  3.0  Muhtar       1       no

In [28]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
# Увеличивает значение в столбце 'age' на 1 для всех строк таблицы df.
df['age'] = df['age'] + 1
# Если нужен отдельный Series с увеличенными значениями:
df

  animal  age     name  visits priority
a    cat  3.5   Murzik       1      yes
b    cat  4.0   Pushok       3      yes
c  snake  1.5      Kaa       2       no
d    dog  NaN    Bobik       3      yes
e    dog  6.0  Strelka       2       no
f    cat  3.0    Vaska       3       no
g  snake  5.5     Kaa2       1       no
h    cat  NaN    Murka       1      yes
i    dog  8.0     Graf       2       no
j    dog  4.0   Muhtar       1       no

In [34]:
df = pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                   'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
                   'name': ['Murzik', 'Pushok', 'Kaa', 'Bobik', 'Strelka', 'Vaska', 'Kaa2', 'Murka', 'Graf', 'Muhtar'],
                   'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                   'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
                    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
index = 'f' # Увеличивает значение в столбце 'age' на 1 для строки с 
# индексом, хранящимся в переменной index.      
df.loc[index, 'age'] += 1
df

  animal  age     name  visits priority
a    cat  2.5   Murzik       1      yes
b    cat  3.0   Pushok       3      yes
c  snake  0.5      Kaa       2       no
d    dog  NaN    Bobik       3      yes
e    dog  5.0  Strelka       2       no
f    cat  3.0    Vaska       3       no
g  snake  4.5     Kaa2       1       no
h    cat  NaN    Murka       1      yes
i    dog  7.0     Graf       2       no
j    dog  3.0   Muhtar       1       no